cases/advection/2Ddeformation/lent-hex-deformation2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     lentAdvect;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo 2; 
maxAlphaCo 0.5;

maxDeltaT 0.01;

libs ("libtwoPhaseValidation.so"); 

functions
{
    advectInterface 
    {
        type harmonic;
        baseType deformation2d; 
        phaseShift 0; 
        period 4; 

        cellVelocityName U; 
        volFluxName phi;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
