cases/advection/2Ddeformation/lent-hex-deformation2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

R 0.25;  
R_divides_h 64; 

H #calc "4*$R";
h #calc "$R / $R_divides_h";
V #calc "$h";
N #calc "int($H / $h)";

convertToMeters 1.00;

vertices
(
    (0    0    0)
    ($H   0    0)
    ($H   $H   0)
    (0    $H   0)
    (0    0    $V)
    ($H   0    $V)
    ($H   $H   $V)
    (0    $H   $V)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($N $N 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch left
    (
        (0 4 7 3)
    )
    patch right
    (
        (2 6 5 1)
    )
    patch front
    (
        (1 5 4 0)
    )
    patch back
    (
        (3 7 6 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
